beber007/zottaos/ZottaOS/CORTEX-Mx/STM32/ZottaOS_Timer.c
volatile BOOL _OSOverflowInterruptFlag = FALSE;
volatile BOOL _OSComparatorInterruptFlag = FALSE;

/* _OSInitializeTimer: Initializes the timer which starts counting as soon as ZottaOS is
** ready to process the first arrival. When the kernel, i.e. when OSStartMultitasking()
** is called, the last operation that is done is to set the timer handler and then start
** the idle task which is the only ready task in the system at that time. The first time
** the idle task executes, it calls _OSStartTimer().
** After _OSInitializeTimer() is called the timer's input divider is selected but it is
** halted.
** Note that the timer ISR updates the wall clock _OSTime with the current value of its
** comparator register CCR and adds 1, and at the very first interrupt, _OSTime must be
** set 0. This is done by initializing CCR with 0 - 1 = 0xFFFF. */
void _OSInitializeTimer(void)
{
  #define IRQ_SET_ENABLE_REGISTER 0xE000E100 // 0xE000E100 to 0xE000E11C (see CortexM3_TRM)
  #define IRQ_PRIORITY_REGISTER   0xE000E400 // 0xE000E400 to 0xE000E41F (see CortexM3_TRM)
  TIMER_ISR_DATA *device;
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     UINT8 tmppriority;
     UINT32 *intSetEnable;
  #endif
  UINT8 *intPriorityLevel;
  CLK_ENABLE |= CLK_ENABLE_BIT;            // Enable the clock for timer
  #ifdef ZOTTAOS_TIMER_32
     TIM_AUTORELOAD = 0x3FFFFFFF;          // Set the autoreload value (2^30 - 1)
  #elif defined(ZOTTAOS_TIMER_16)
     TIM_AUTORELOAD = 0xFFFF;              // Set the autoreload value (2^16 - 1)
  #endif
  TIM_PRESCALER = ZOTTAOS_TIMER_PRESCALER; // Set timer clock prescaler to the
                                           // ZOTTAOS_TIMER_PRESCALER. This value is define
                                           // in ZottaOS_Config.h file.
  TIM_EVENT_GENERATION = UPDATE_INT_BIT;   // Generate an update event to reload the prescaler
  TIM_STATUS = ~(UPDATE_INT_BIT | COMPARATOR_INT_BIT);   // Clear update flag
  TIM_INT_ENABLE |= UPDATE_INT_BIT | COMPARATOR_INT_BIT; // Enable update interrupt
  /*** Initialize Cortex-Mx Nested Vectored Interrupt Controller ***/
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     /* Compute the priority (Only 4 bits are used for priority on STM32) */
     tmppriority = TIMER_PRIORITY << (PRIGROUP - 3); // (PRIGROUP - 3) is the number of sub priority bits
     tmppriority |=  TIMER_SUB_PRIORITY & (0x0F >> (7 - PRIGROUP)); // (7 - PRIGROUP) is the number priority bits
  #endif
  /* Set the IRQ priority */
  intPriorityLevel = (UINT8 *)(IRQ_PRIORITY_REGISTER + ZOTTAOS_TIMER);
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     *intPriorityLevel = tmppriority << 4; // Only 4 MSB bits are used on STM32
  #elif defined(CORTEX_M0)
     *intPriorityLevel = TIMER_PRIORITY;
  #endif
  /* Enable the IRQ channels */
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     intSetEnable = (UINT32 *)IRQ_SET_ENABLE_REGISTER + (UINT32)(ZOTTAOS_TIMER / 32);
     *intSetEnable |= 0x01 << (ZOTTAOS_TIMER % 32);
  #elif defined(CORTEX_M0)
     *(UINT32 *)IRQ_SET_ENABLE_REGISTER |= 0x01 << ZOTTAOS_TIMER;
  #endif
  /* Initialize ZottaOS internal interrupt structure */
  #if ZOTTAOS_TIMER == OS_IO_TIM1
     /* Comparator interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_cc;
     OSSetTimerISRDescriptor(OS_IO_TIM1_CC,0,device);
     /* Update interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_up;
     OSSetTimerISRDescriptor(OS_IO_TIM1_UP,0,device);
     /* Set the IRQ priority */
     intPriorityLevel = (UINT8 *)(IRQ_PRIORITY_REGISTER + OS_IO_TIM1_UP);
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        *intPriorityLevel = tmppriority << 4; // Only 4 MSB bits are used on STM32
     #elif defined(CORTEX_M0)
        *intPriorityLevel = priority;
     #endif
     /* Enable the IRQ channels */
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        intSetEnable = (UINT32 *)IRQ_SET_ENABLE_REGISTER + (UINT32)(OS_IO_TIM1_UP / 32);
        *intSetEnable |= 0x01 << (OS_IO_TIM1_UP % 32);
     #elif defined(CORTEX_M0)
        *(UINT32 *)IRQ_SET_ENABLE_REGISTER |= 0x01 << OS_IO_TIM1_UP;
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM2
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     OSSetTimerISRDescriptor(OS_IO_TIM2,0,device);
  #elif ZOTTAOS_TIMER == OS_IO_TIM3
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     OSSetTimerISRDescriptor(OS_IO_TIM3,0,device);
  #elif ZOTTAOS_TIMER == OS_IO_TIM4
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     OSSetTimerISRDescriptor(OS_IO_TIM4,0,device);
  #elif ZOTTAOS_TIMER == OS_IO_TIM5
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     OSSetTimerISRDescriptor(OS_IO_TIM5,0,device);
  #elif ZOTTAOS_TIMER == OS_IO_TIM8
     /* Comparator interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_cc;
     OSSetTimerISRDescriptor(OS_IO_TIM8_CC,0,device);
     /* Update interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_up;
     OSSetTimerISRDescriptor(OS_IO_TIM8_UP,0,device);
     /* Set the IRQ priority */
     intPriorityLevel = (UINT8 *)(IRQ_PRIORITY_REGISTER + OS_IO_TIM8_UP);
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        *intPriorityLevel = tmppriority << 4; // Only 4 MSB bits are used on STM32
     #elif defined(CORTEX_M0)
        *intPriorityLevel = priority;
     #endif
     /* Enable the IRQ channels */
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        intSetEnable = (UINT32 *)IRQ_SET_ENABLE_REGISTER + (UINT32)(OS_IO_TIM8_UP / 32);
        *intSetEnable |= 0x01 << (OS_IO_TIM1_UP % 32);
     #elif defined(CORTEX_M0)
        *(UINT32 *)IRQ_SET_ENABLE_REGISTER |= 0x01 << OS_IO_TIM8_UP;
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM9
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     #ifdef OS_IO_TIM1_BRK_TIM9
        OSSetTimerISRDescriptor(OS_IO_TIM1_BRK_TIM9,1,device);
     #else
        OSSetTimerISRDescriptor(OS_IO_TIM9,0,device);
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM10
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     #ifdef OS_IO_TIM1_UP_TIM10
        OSSetTimerISRDescriptor(OS_IO_TIM1_UP_TIM10,1,device);
     #else
        OSSetTimerISRDescriptor(OS_IO_TIM10,0,device);
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM11
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     #ifdef OS_IO_TIM1_TRG_COM_TIM11
        OSSetTimerISRDescriptor(OS_IO_TIM1_TRG_COM_TIM11,1,device);
     #else
        OSSetTimerISRDescriptor(OS_IO_TIM11,0,device);
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM12
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     #ifdef OS_IO_TIM8_BRK_TIM12
        OSSetTimerISRDescriptor(OS_IO_TIM8_BRK_TIM12,1,device);
     #else
        OSSetTimerISRDescriptor(OS_IO_TIM12,0,device);
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM13
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     #ifdef OS_IO_TIM8_UP_TIM13
        OSSetTimerISRDescriptor(OS_IO_TIM8_UP_TIM13,1,device);
     #else
        OSSetTimerISRDescriptor(OS_IO_TIM13,0,device);
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM14
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     #ifdef OS_IO_TIM8_TRG_COM_TIM14
        OSSetTimerISRDescriptor(OS_IO_TIM8_TRG_COM_TIM14,1,device);
     #else
        OSSetTimerISRDescriptor(OS_IO_TIM14,0,device);
     #endif
  #elif ZOTTAOS_TIMER == OS_IO_TIM15
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     OSSetTimerISRDescriptor(OS_IO_TIM15,1,device);
  #elif ZOTTAOS_TIMER == OS_IO_TIM16
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = _OSTimerHandler;
     OSSetTimerISRDescriptor(OS_IO_TIM16,1,device);
  #elif ZOTTAOS_TIMER == OS_IO_TIM17
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     OSSetTimerISRDescriptor(OS_IO_TIM17,1,device);
  #endif
} /* end of _OSInitializeTimer */


/* _OSStartTimer: Starts the interval timer by setting it to up mode. This function is
** called only once when the kernel is ready to schedule the first application task. */
void _OSStartTimer(void)
{
  TIM_CONTROL1 |= 1;                          // Enable the TIM Counter
  TIM_EVENT_GENERATION |= COMPARATOR_INT_BIT; // Generate the first comparator interrupt
} /* end of _OSStartTimer */


/* _TimerHandler: Catches STM-32 Timer interrupts and generates a software timer
** interrupt which is than carried out at a lower priority.
** Note: This function could have been written in assembler to reduce interrupt latencies. */
/* Claude Dans le cas du timer 1 ou 8, plusieurs vecteurs d'interruptions sont définit. Il
** devient préférable de les traiter de manière séparée. */
#if ZOTTAOS_TIMER == OS_IO_TIM1 || ZOTTAOS_TIMER == OS_IO_TIM8
   void TimerHandler_up(struct TIMER_ISR_DATA *descriptor)
   {
     TIM_STATUS &= ~UPDATE_INT_BIT; // Clear interrupt flag
     #ifdef ZOTTAOS_TIMER_16
        Time += 1; // Increment most significant word of Time
     #endif
     _OSOverflowInterruptFlag = TRUE;
     _OSGenerateSoftTimerInterrupt();
   } /* end of TimerHandler_up */

   void TimerHandler_cc(struct TIMER_ISR_DATA *descriptor)
   {
     TIM_STATUS &= ~COMPARATOR_INT_BIT; // Clear interrupt flag
     TIM_COMPARATOR = 0;                // Disable timer comparator
     _OSComparatorInterruptFlag = TRUE;
     _OSGenerateSoftTimerInterrupt();
   } /* end of TimerHandler_cc */
#else
   void TimerHandler(struct TIMER_ISR_DATA *descriptor)
   {
     if (TIM_STATUS & UPDATE_INT_BIT) {    // Is timer overflow interrupt?
        TIM_STATUS &= ~UPDATE_INT_BIT;     // Clear interrupt flag
        #ifdef ZOTTAOS_TIMER_16
           Time += 1; // Increment most significant word of Time
        #endif
        _OSOverflowInterruptFlag = TRUE;
        _OSGenerateSoftTimerInterrupt();
     }
     if (TIM_STATUS & COMPARATOR_INT_BIT) { // Is comparator interrupt pending?
        TIM_STATUS &= ~COMPARATOR_INT_BIT; // Clear interrupt flag
        TIM_COMPARATOR = 0; // Disable timer comparator
        _OSComparatorInterruptFlag = TRUE;
        _OSGenerateSoftTimerInterrupt();
     }
   } /* end of TimerHandler */
#endif


/* Claude */
/* _OSTimerSelectorHandler: à reprendre depuis le fichier d'en-tête. */
void _OSTimerSelectorHandler(struct TIMERSELECT *timerSelect)
{
  #define OFFSET_STATUS 0x10 // Offset to retrieve the interrupt flags bits register
  #define OFFSET_ENABLE 0x0C // Offset to retrieve the interrupt enable bits register
  TIMER_ISR_DATA *peripheralIODescriptor;
  /* Call the specific handler */
  /* Claude Le handler de la première source est appelé uniquement si la source correspond au vecteur, car
  ** la première source correspond tjs au Timer 1 ou 8 qui ont 4 vecteurs d'interruption chacun. */
  if (*(UINT32 *)(timerSelect->BaseRegisterTab[0] + OFFSET_STATUS) &
      *(UINT32 *)(timerSelect->BaseRegisterTab[0] + OFFSET_ENABLE) &
      timerSelect->InterruptBit) {
     peripheralIODescriptor = timerSelect->TimerISRTab[0];
     peripheralIODescriptor->TimerIntHandler(peripheralIODescriptor);
  }
  /* Claude Le handler de la seconde source est appelé quelque soit la source d'interruption, car
  ** les timer traité au seconde position on tjs un seul vecteur pour toute leurs sources. */
  if (*(UINT32 *)(timerSelect->BaseRegisterTab[1] + OFFSET_STATUS) &
      *(UINT32 *)(timerSelect->BaseRegisterTab[1] + OFFSET_ENABLE)) {
     peripheralIODescriptor = timerSelect->TimerISRTab[1];
     peripheralIODescriptor->TimerIntHandler(peripheralIODescriptor);
  }
} /* end of _OSTimerSelectorHandler */


/* _OSSetTimer: Sets the timer comparator to the next time event interval. This function
 * is called by the software timer interrupt handler when it finishes processing the cur-
 * rent interrupt and prepares its next interrupt. */
BOOL _OSSetTimer(INT32 nextArrival)
{
  #ifdef ZOTTAOS_TIMER_32
     TIM_COMPARATOR = nextArrival;
     return TIM_COMPARATOR > TIM_COUNTER;
  #elif defined(ZOTTAOS_TIMER_16)
     if (nextArrival >> 16 == Time) {
        TIM_COMPARATOR = (UINT16)nextArrival;
        return TIM_COMPARATOR > TIM_COUNTER;
     }
     else
        return TRUE;
#endif
} /* end of _OSSetTimer */


/* _OSTimerIsOverflow: return true if a timer overflow occurs. */
BOOL _OSTimerIsOverflow(INT32 shiftTimeLimit)
{
  #ifdef ZOTTAOS_TIMER_32
     if (_OSOverflowInterruptFlag) {
        _OSOverflowInterruptFlag = FALSE;
        return TRUE;
     }
     else
        return FALSE;
  #elif defined(ZOTTAOS_TIMER_16)
     INT16 tmp, time;
     if (_OSOverflowInterruptFlag) {
        _OSOverflowInterruptFlag = FALSE;
        if ((tmp = shiftTimeLimit >> 16) < Time) {
           do {
              time = OSINT16_LL((INT16 *)&Time);
              time -= tmp;
           } while (!OSINT16_SC((INT16 *)&Time,time));
           return TRUE;
        }
     }
     return FALSE;
  #endif
} /* end of _OSTimerIsOverflow */


/* OSGetActualTime: Retrieve the current time. Combines the 16 bits of the timer counter
** with the global variable Time to yield the current time. */
INT32 OSGetActualTime(void)
{
  #ifdef ZOTTAOS_TIMER_32
     return TIM_COUNTER;
  #elif defined(ZOTTAOS_TIMER_16)
     INT16 currentTime;
     INT32 tmp;
     do {
        currentTime = Time;
        tmp = (INT32)currentTime << 16 | TIM_COUNTER;
     } while (currentTime != Time);
     return tmp;
  #endif
} /* end of OSGetActualTime */
